# M5 Forecasting - Accuracy

[Estimate the unit sales of Walmart retail goods](https://www.kaggle.com/c/m5-forecasting-accuracy)

_Y. Sun_

## References

https://otexts.com/fpp2/hierarchical.html (Theory)

https://www.kaggle.com/c/m5-forecasting-accuracy/discussion/142656 (Hierarchical structure of dtasets)

https://www.kaggle.com/headsortails/back-to-predict-the-future-interactive-m5-eda (Comprehensive EDA by R)

## EDA

In [6]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sns
import plotly.graph_objects as go

%matplotlib inline

In [2]:
# load the data
DATA_PATH = '/home/ys/data/m5-forecasting/'

sales = pd.read_csv(f'{DATA_PATH}/sales_train_evaluation.csv')
cal = pd.read_csv(f'{DATA_PATH}/calendar.csv')
prices = pd.read_csv(f'{DATA_PATH}/sell_prices.csv')

#sample_submission = pd.read_csv(f'{DATA_PATH}/sample_submission.csv')

In [14]:
sales.iloc[:5, :]

,id,item_id,dept_id,cat_id,store_id,state_id,d_1,d_2,d_3,d_4,...,d_1932,d_1933,d_1934,d_1935,d_1936,d_1937,d_1938,d_1939,d_1940,d_1941
0,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,2,4,0,0,0,0,3,3,0,1
1,HOBBIES_1_002_CA_1_evaluation,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,1,2,1,1,0,0,0,0,0
2,HOBBIES_1_003_CA_1_evaluation,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,1,0,2,0,0,0,2,3,0,1
3,HOBBIES_1_004_CA_1_evaluation,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,1,1,0,4,0,1,3,0,2,6
4,HOBBIES_1_005_CA_1_evaluation,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,0,0,2,1,0,0,2,1,0

In [ ]:
## EDA for sales
# All aggregate sales
# ...

# Sales per State
# ...

# Sales per Store & Category
# ...

# Sales per Department
# ...

# Seasonalities
# global trends with smoothing fit
# month (1-12) and weeks (1-7) trends with residuals
# ...

In [ ]:
## EDA for price and cal
# events and event types ratio globally
# ...
# SNAP in 3 states (SNAP no later than 15th for all states)
# ...
# itme prices by different category and department (show by histogram) 
# ...
# sales with events and non-events and with 4 special events (different items or states)
# ...
# SNAP vary with day of week and month (heatmap, could improve)

In [21]:
cal.iloc[-10:,:]

,date,wm_yr_wk,weekday,wday,month,year,d,event_name_1,event_type_1,event_name_2,event_type_2,snap_CA,snap_TX,snap_WI
1959,2016-06-10,11619,Friday,7,6,2016,d_1960,NaN,NaN,NaN,NaN,1,0,0
1960,2016-06-11,11620,Saturday,1,6,2016,d_1961,NaN,NaN,NaN,NaN,0,1,1
1961,2016-06-12,11620,Sunday,2,6,2016,d_1962,NaN,NaN,NaN,NaN,0,1,1
1962,2016-06-13,11620,Monday,3,6,2016,d_1963,NaN,NaN,NaN,NaN,0,1,0
1963,2016-06-14,11620,Tuesday,4,6,2016,d_1964,NaN,NaN,NaN,NaN,0,0,1
1964,2016-06-15,11620,Wednesday,5,6,2016,d_1965,NaN,NaN,NaN,NaN,0,1,1
1965,2016-06-16,11620,Thursday,6,6,2016,d_1966,NaN,NaN,NaN,NaN,0,0,0
1966,2016-06-17,11620,Friday,7,6,2016,d_1967,NaN,NaN,NaN,NaN,0,0,0
1967,2016-06-18,11621,Saturday,1,6,2016,d_1968,NaN,NaN,NaN,NaN,0,0,0
1968,2016-06-19,11621,Sunday,2,6,2016,d_1969,NBAFinalsEnd,Sporting,Father's day,Cultural,0,0,0

In [22]:
prices.iloc[-10:,:]

        store_id      item_id  wm_yr_wk  sell_price
6841111     WI_3  FOODS_3_827     11612         1.0
6841112     WI_3  FOODS_3_827     11613         1.0
6841113     WI_3  FOODS_3_827     11614         1.0
6841114     WI_3  FOODS_3_827     11615         1.0
6841115     WI_3  FOODS_3_827     11616         1.0
6841116     WI_3  FOODS_3_827     11617         1.0
6841117     WI_3  FOODS_3_827     11618         1.0
6841118     WI_3  FOODS_3_827     11619         1.0
6841119     WI_3  FOODS_3_827     11620         1.0
6841120     WI_3  FOODS_3_827     11621         1.0

In [5]:
ids = sorted(list(set(sales['id'])))
ids

30490

## Submission

In [1]:
# submit
!kaggle competitions submit -c m5-forecasting-accuracy -f submission.csv -m "baseline 00"

100%|███████████████████████████████████████| 16.2M/16.2M [00:24<00:00, 685kB/s]
Successfully submitted to M5 Forecasting - Accuracy

In [12]:
# scoring
!kaggle competitions submissions -c m5-forecasting-accuracy

fileName        date                 description  status    publicScore  privateScore
--------------  -------------------  -----------  --------  -----------  ------------
submission.csv  2020-05-04 19:00:10  baseline 00  complete  1.07118      None